'use strict' 

// Залишкові параметри та синтаксис поширення

/* Mіж Array.from(obj) та [...obj] є тонка різниця:

Array.from працює як з масиво-подібними об’єктами, так і з об’єктами, що ітеруються.
Синтаксис розширення працює тільки з ітераторами.
Отже, для завдання перетворити щось на масив Array.from буде більш універсальним. */

/* Цей спосіб копіювання об’єкта набагато коротший, ніж let objCopy = Object.assign({}, obj) чи для масиву let arrCopy = Object.assign([], arr) тому ми вважаємо за краще використовувати його, коли це можливо. */