'use strict' 

// Оператори порівняння повертають значення логічного типу.
// Рядки порівнюються посимвольно в лексикографічному порядку.
// Значення різних типів під час порівняння конвертуються в числа. Винятками є порівняння за допомогою операторів строгої рівності/нерівності.
// Значення null і undefined рівні == один одному і не рівні будь-якому іншому значенню.
// Будьте обережні, використовуючи оператори порівняння на зразок > чи < зі змінними, які можуть приймати значення null/undefined. Хорошою ідеєю буде зробити окрему перевірку на null/undefined для таких значень.

5 > 4 // true
"ананас" > "яблуко" //false
"2" > "12" //true
undefined == null //true
undefined === null //false
null == "\n0\n" //false (null equals only undefined)
null === +"\n0\n" //false