'use strict' 

// Статичні властивості та методи

/* Статичні методи використовуються для функціональності, що належить до класу «в цілому». Це не стосується конкретного екземпляра класу.

Наприклад, метод порівняння Article.compare(article1, article2) або фабричний метод Article.createTodays().

В оголошенні класу вони позначені ключовим словом static.

Статичні властивості використовуються тоді, коли ми хочемо зберігати дані на рівні класу, а не якогось одного екземпляра.

Синтаксис:

class MyClass {
  static property = ...;

  static method() {
    ...
  }
}
Технічно, статичне оголошення – це те ж саме, що й присвоєння класу:

MyClass.property = ...
MyClass.method = ...
Статичні властивості та методи успадковуються.

Для class B extends A, прототип класу B вказує на A: B.[[Prototype]] = A. Тож якщо поле не знайдено в B, пошук продовжується в A. */