'use strict' 

// Розширення класу

/* Щоб розширити клас треба використовувати синтакс: class Child extends Parent:
Це означає Child.prototype.__proto__ буде Parent.prototype, таким чином методи успадковуються.
При перевизначенні конструктора:
Ми повинні викликати батьківський конструктор super() в Child конструкторі перед використанням this.
При перевизначенні іншого методу:
Ми можемо використовувати super.method() в методі Child, щоб викликати за батьківський метод.
Внутрішні деталі:
Методи запам’ятовують їх клас/об’єкт у внутрішній властивості [[HomeObject]]. Ось як super знаходить батьківські методи.
Так що це не безпечно копіювати метод з супер від одного об’єкта до іншого.
Також:

Стрілочні функції не мають власного this або super, тому вони прозоро вписуються в навколишній контекст.
 */