'use strict' 

// VAr

/* Існує дві основні відмінності між var та let/const:

Змінні var не мають блочної області видимості, їх видимість визначається поточною функцією або глобально, якщо оголошені поза функцією.
Оголошення за допомогою var обробляються при запуску функції (або скрипта для глобальних змінних).
Існує ще одна дуже незначна відмінність, пов’язана з глобальним об’єктом, яку ми розглянемо в наступному розділі.

Ці відмінності роблять var гірше, ніж let у більшості випадків. Блочна область видимості – гарна річ. Ось чому let давно був введений до стандарту і тепер є основним способом (разом з const) оголошування змінних. */