'use strict' 

// Global object

/* Глобальний об’єкт містить змінні, які мають бути доступними скрізь.

Включаючи вбудовані у JavaScript, такі як Array, та значення, характерні для середовища, такі як window.innerHeight – висота вікна у браузері.

Глобальний об’єкт має універсальну назву globalThis.

… Але частіше згадуються специфічні назви середовища “старої школи”, такі як window (браузер) та global (Node.js).

Ми повинні зберігати значення у глобальному об’єкті, лише якщо вони дійсно глобальні для нашого проєкту. І тримати їх кількість мінімальною.

В браузерах, якщо ми не використовуємо модулі, глобальні функції та змінні, оголошені за допомогою var, стають властивістю глобального об’єкта.

Для того, щоб код був простішим і в майбутньому його легше було підтримувати, слід звертатися до властивостей глобального об’єкта безпосередньо, через window.x. */