'use strict' 

alert(2 + 2 + '1' ); // "41", а не "221"
alert('1' + 2 + 2); // "122", а не "14"

// ланцюгове присвоєння

let a, b, c;

a = b = c = 2 + 2;

alert( a ); // 4
alert( b ); // 4
alert( c ); // 4

"" + 1 + 0 // ' 10'
"" - 1 + 0 // -1
true + false // 1
6 / "3" // 2
"2" * "3" // 6
4 + 5 + "px" // '9px'
"$" + 4 + 5 // '$45'
"4" - 2 // 2
"4px" - 2 // NaN
"  -9  " + 5 // ' -9 5' пробіли не будуть прибиратись
"  -9  " - 5 // -14
null + 1 // 1, налл стає 0
undefined + 1 // NaN
" \t \n" - 2 // -2 Символи пробілів по краях рядка ігноруються під час перетворення в число. Тому рядок, який містить лише символи \t, \n або «звичайні» пробіли, прирівнюється до пустого рядка і стає 0 після числового перетворення.