/*  
Змінна це “іменована частинка сховища”, в якій зберігаються дані.
*/
'use strict' 

let admin;
let name = 'Dima';
admin = name;
alert(admin);

/* let user = 'Dima', age = 23, phrase = 'Hello!'; not recommended 

В JavaScript є два обмеження, які стосуються імен змінних:

- Ім’я має містити лише букви, цифри або символи $ і _.
- Перший символ не має бути числом.

Щоб оголосити константу (незмінювану) змінну, використовуйте ключове слово const замість let.
Змінні, оголошені за допомогою const, називаються “константами”. Їхні значення не можна переприсвоювати. 
*/
