'use strict' 

// Синтаксис "new Function"

/* Є ще один спосіб створити функцію. Він рідко використовується, але йому немає альтернативи.
    
Syntax
let func = new Function ([arg1, arg2, ...argN], functionBody);
Example:
let sum = new Function('a', 'b', 'return a + b');

new Function дозволяє перетворити будь-який рядок у функцію. Наприклад, ми можемо отримати нову функцію з сервера, а потім виконати її

- envirinment буде глобальним => не має доступу до блочних змінних. Якби new Function мала доступ до зовнішніх змінних, то вона б мала проблеми з мініфікаторами.
*/